{
  "backend/main.mo": "Defines a simple actor exposing a query method that returns an empty Nat array.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files describing their roles and functionality.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, dark mode variables, and base element styling.",
  "frontend/index.html": "HTML entry point with Gujarati language metadata and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for Home, About, Services, and Contact using a shared layout.",
  "frontend/src/components/BrandHeader.tsx": "Renders the brand name in Gujarati with configurable size and styling.",
  "frontend/src/components/Layout.tsx": "Defines the site-wide layout including navigation, content outlet, and footer.",
  "frontend/src/components/ReplaceableImage.tsx": "Image component supporting local image uploads with empty-state placeholders and hover-to-replace behavior.",
  "frontend/src/components/ServiceCard.tsx": "Displays a service title paired with an optional uploadable image placeholder.",
  "frontend/src/components/SiteNav.tsx": "Navigation header with active-route highlighting and Gujarati labels.",
  "frontend/src/content/gu.ts": "Central Gujarati content dictionary containing strings for navigation, pages, services, and contact info.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance tied to Internet Identity, refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context and provider for Internet Identity authentication using Dfinity AuthClient, exposing identity state, login, and logout methods.",
  "frontend/src/index.css": "Configures Tailwind layers, custom CSS variables, fonts, and utility classes for consistent theming and styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with an image, description text, and owner information pulled from localized content.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details including phone, address, hours, and a call‑to‑action button, using localized content.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page hero, working hours, call button, and important notes using content-driven components.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a list of service offerings and an important note section, rendering each service with a ServiceCard component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, container settings, and animations with custom design tokens.",
  "project_state.json": "Defines the project’s current state and constraints for a Gujarati-only tailoring business website built with React and Tailwind, including design rules, image restrictions, services, and required pages. Also lists existing features, requirements, and architectural notes for continued development."
}