{
  "kind": "build_request",
  "title": "Replace auto-inserted illustrations with empty user-controlled upload placeholders and update Gujarati business content",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-11",
      "text": "Replace all auto-inserted/generated images across the site with strictly empty, optional, user-controlled image placeholders that include an “Upload Image / Add Image” UI in the image area, and ensure the website still looks complete and professional when no images are provided.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "IMPORTANT IMAGE RULES (STRICT):\n- Do NOT auto-insert random or stock images\n- Create image sections with EMPTY placeholders only\n- Show “Upload Image / Add Image” option in image areas\n- Images must be optional and fully user-controlled\n- Website should look complete even without images"
        ]
      },
      "acceptanceCriteria": [
        "No pages render any default illustration/icon image (e.g., no /assets/generated/... images displayed by default).",
        "Each image area renders an empty placeholder UI with a visible call-to-action equivalent to “Upload Image / Add Image”.",
        "Users can select an image file from their device and see a preview replacing the placeholder in that specific image area.",
        "If a user does not upload an image, the section layout remains visually complete (no broken-image icons, no awkward empty gaps).",
        "No stock images or AI-generated images are automatically inserted anywhere."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Update the image component(s) used across pages (currently the ReplaceableImage component) so that it supports empty-state placeholders and user uploads (client-side), rather than requiring a src URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Create image sections with EMPTY placeholders only",
          "Show “Upload Image / Add Image” option in image areas"
        ]
      },
      "acceptanceCriteria": [
        "The shared image component can render with no image provided (empty state).",
        "The shared image component provides a file input / upload interaction directly in the image area.",
        "The shared image component does not require a non-empty src prop to function.",
        "Any existing “replaceable” labeling is updated to align with the new upload placeholder UX (Gujarati UI text)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update all Gujarati site content to match the provided business scope and details: include Ladies, Gents & Kids tailoring (work-from-home), owner name, working hours, mobile number, and add the full address on the Contact page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Business Type: Ladies, Gents & Kids Tailoring (Work From Home)",
          "Working Time: 7:00 AM to 9:00 PM",
          "Mobile Number: 7359316413",
          "Address:\n  Plot No. 10,\n  Keshav Township,\n  Opposite Trinity School,\n  Sabarkantha Road,\n  Talod – 383305"
        ]
      },
      "acceptanceCriteria": [
        "Home, About, Services, and Contact pages all use formal Gujarati-only text for headings, paragraphs, buttons, and labels.",
        "The Contact page displays the complete multi-line address exactly as provided.",
        "Mobile number 7359316413 is highlighted and clickable via a tel: link where appropriate.",
        "Working hours are displayed as 7:00 AM to 9:00 PM (Gujarati rendering is acceptable as long as the time range matches).",
        "About page explicitly states work-from-home and includes the owner name Patel Geetaben J. in Gujarati."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Replace the Services page list with the new set of services (written in formal Gujarati) provided by the user, and include optional empty image placeholders for service-related images/icons (user uploaded).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "SERVICES (WRITE IN FORMAL GUJARATI):\n- Ladies blouse stitching (simple and designer)\n- Navratri special chaniya choli stitching\n- Fancy dress and western dress stitching\n- Normal gents kurta stitching\n- Kurta stitching for children\n- Saree lace (less pati) stitching service"
        ]
      },
      "acceptanceCriteria": [
        "Services page displays exactly 6 services matching the user-provided list (in formal Gujarati).",
        "Each service row/card includes an optional upload placeholder area for an icon/image, with “Upload Image / Add Image” UI.",
        "No pre-filled service icons are shown by default.",
        "Services layout remains clean and readable on mobile and desktop."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add the user’s “Important Note” copy prominently (in formal Gujarati) on an appropriate page section (e.g., Home and/or Services and/or About) so it is clearly visible to visitors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "IMPORTANT NOTE (Must be mentioned clearly):\n- Ladies, gents and children’s garment fitting services are provided\n- All stitching services are offered at affordable and reasonable prices\n- Quality finishing, proper fitting and timely delivery are our priorities"
        ]
      },
      "acceptanceCriteria": [
        "The site includes Gujarati text clearly stating: (1) fitting services for ladies/gents/kids are provided, (2) affordable/reasonable pricing, (3) quality finishing, proper fitting, timely delivery.",
        "The note is displayed as a distinct, readable block (e.g., card or callout) and is easy to find without needing images.",
        "All text remains Gujarati-only and matches the formal/professional tone."
      ]
    }
  ],
  "constraints": [
    "Do not auto-insert any stock/AI/random images anywhere; all images must be optional and user-controlled via upload placeholders.",
    "All visible website text must be Gujarati-only and use a Gujarati-compatible font across the site.",
    "Follow the strict design rules: background white or very light cream; normal text black; shop name “Gayatri Ladies Tailor” styled as large, elegant, dark red.",
    "No heavy animations.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing backend storage for uploaded images (uploads may remain client-side only unless explicitly requested later).",
    "Adding new pages beyond Home, About Us, Services, and Contact Us.",
    "Changing authentication or adding third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}