{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Empty upload placeholders for all images + updated Gujarati tailoring business content",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Remove all auto-inserted/generated images and render only optional, user-uploaded image placeholders with preview while keeping layouts visually complete without images.",
      "acceptanceCriteria": [
        "No pages render any default illustration/icon image (e.g., no /assets/generated/... images displayed by default).",
        "Each image area renders an empty placeholder UI with a visible call-to-action equivalent to “Upload Image / Add Image”.",
        "Users can select an image file from their device and see a preview replacing the placeholder in that specific image area.",
        "If a user does not upload an image, the section layout remains visually complete (no broken-image icons, no awkward empty gaps).",
        "No stock images or AI-generated images are automatically inserted anywhere."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Remove the default generated hero illustration reference and switch the hero image area to render the shared upload-placeholder image component with no initial src; ensure spacing/typography looks complete when empty. (If using shadcn-ui Button for CTAs, verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Remove the default generated about illustration reference and render an empty upload-placeholder image area via the shared image component; keep the card layout professional with or without an uploaded image."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Remove the default generated phone icon image reference and render an empty upload-placeholder image area via the shared image component; preserve clean centering and spacing when no image is uploaded. (If using shadcn-ui Button for CTAs, verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Stop passing any default generated iconSrc values to service items so no pre-filled service images render; rely on per-service upload placeholders within each service card."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Update the shared ReplaceableImage component to support an empty state and in-place client-side uploads with Gujarati placeholder UI text.",
      "acceptanceCriteria": [
        "The shared image component can render with no image provided (empty state).",
        "The shared image component provides a file input / upload interaction directly in the image area.",
        "The shared image component does not require a non-empty src prop to function.",
        "Any existing “replaceable” labeling is updated to align with the new upload placeholder UX (Gujarati UI text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReplaceableImage.tsx",
          "operation": "modify",
          "description": "Redesign ReplaceableImage to accept an optional initial src (or no src), render a polished empty placeholder (no <img> when empty), and provide an in-area file input that shows a local preview when the user selects a file; replace the current “બદલી શકાય તેવું” overlay with Gujarati upload CTA text equivalent to “છબી અપલોડ કરો / છબી ઉમેરો”."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal global styles/utilities (within existing Tailwind layers) to support a consistent, professional placeholder appearance (borders, subtle background, focus states) that works on white/cream backgrounds and does not rely on images."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Update centralized Gujarati content for the tailoring business (scope, owner, hours, phone) and display the full address on Contact.",
      "acceptanceCriteria": [
        "Home, About, Services, and Contact pages all use formal Gujarati-only text for headings, paragraphs, buttons, and labels.",
        "The Contact page displays the complete multi-line address exactly as provided.",
        "Mobile number 7359316413 is highlighted and clickable via a tel: link where appropriate.",
        "Working hours are displayed as 7:00 AM to 9:00 PM (Gujarati rendering is acceptable as long as the time range matches).",
        "About page explicitly states work-from-home and includes the owner name Patel Geetaben J. in Gujarati."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/gu.ts",
          "operation": "modify",
          "description": "Update Gujarati-only business copy to reflect: Ladies, Gents & Kids tailoring (work-from-home), owner name પટેલ ગીતાબેન જે., working time 7:00 AM to 9:00 PM, phone number 7359316413, and add the full address text for use on Contact; ensure labels/headings remain formal Gujarati."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Ensure About page content sections explicitly mention work-from-home and reflect the updated owner name in Gujarati using the centralized content."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure Home page uses the updated Gujarati business scope and working-hours rendering from centralized content; keep tel: linking for 7359316413. (If using shadcn-ui Button for CTAs, verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Add a clearly formatted, multi-line address block that displays exactly: Plot No. 10, Keshav Township, Opposite Trinity School, Sabarkantha Road, Talod – 383305 (Gujarati surrounding labels allowed), and keep phone number as a prominent tel: link. (If using shadcn-ui Button for CTAs, verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Replace Services page with the new 6-service Gujarati list and add per-service optional upload placeholders for icons/images.",
      "acceptanceCriteria": [
        "Services page displays exactly 6 services matching the user-provided list (in formal Gujarati).",
        "Each service row/card includes an optional upload placeholder area for an icon/image, with “Upload Image / Add Image” UI.",
        "No pre-filled service icons are shown by default.",
        "Services layout remains clean and readable on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/gu.ts",
          "operation": "modify",
          "description": "Replace Services strings with formal Gujarati equivalents for exactly these 6 items: (1) Ladies blouse stitching (simple and designer), (2) Navratri special chaniya choli stitching, (3) Fancy dress and western dress stitching, (4) Normal gents kurta stitching, (5) Kurta stitching for children, (6) Saree lace (less pati) stitching service."
        },
        {
          "path": "frontend/src/components/ServiceCard.tsx",
          "operation": "modify",
          "description": "Update ServiceCard so the service image/icon area uses the updated ReplaceableImage empty upload placeholder (no required iconSrc prop); keep card layout centered and consistent even when no image is uploaded."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Render exactly 6 services from centralized Gujarati content and ensure each card includes the optional upload placeholder area (via ServiceCard + ReplaceableImage) with no default images."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Add a prominent Gujarati “Important Note” block that is easy to find and does not rely on images.",
      "acceptanceCriteria": [
        "The site includes Gujarati text clearly stating: (1) fitting services for ladies/gents/kids are provided, (2) affordable/reasonable pricing, (3) quality finishing, proper fitting, timely delivery.",
        "The note is displayed as a distinct, readable block (e.g., card or callout) and is easy to find without needing images.",
        "All text remains Gujarati-only and matches the formal/professional tone."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/gu.ts",
          "operation": "modify",
          "description": "Add formal Gujarati “Important Note” copy covering: fitting services for ladies/gents/kids, affordable/reasonable pricing, and priorities of quality finishing, proper fitting, and timely delivery."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a distinct, prominent callout/card section for the Gujarati Important Note (text-only, no images required) placed in a highly visible area on the Home page."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Add the same Gujarati Important Note as a readable block on the Services page (e.g., above or below the service grid) so visitors see it even if they navigate directly to Services."
        }
      ]
    }
  ]
}